app/views/admin/inquiries/index.html.erb

  <div class="flex border-b border-gray-100 overflow-x-auto">
    <% [
      [nil, "Все", @stats[:total]],
      ["new_inquiry", "Новые", @stats[:new_inquiry]],
      ["in_progress", "В работе", @stats[:in_progress]],
      ["completed", "Завершены", @stats[:completed]],
      ["cancelled", "Отменены", nil]
    ].each do |status, label, count| %>
---
SELECT COUNT(*) FROM "inquiries" WHERE "inquiries"."status" = ?  [["status", 0]]