app/controllers/admin/inquiries_controller.rb

SELECT 1 AS one FROM "inquiries" WHERE "inquiries"."status" = ? LIMIT ? OFFSET ?  [["status", 2], ["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "inquiries"
---
    scope = scope.where(status: params[:status]) if params[:status].present? && Inquiry.statuses.key?(params[:status])
    @pagy, @inquiries = pagy(scope, limit: 25)

    @stats = {
      total:       Inquiry.count,
      new_inquiry: Inquiry.new_inquiry.count,
      in_progress: Inquiry.in_progress.count,
      completed:   Inquiry.completed.count