app/controllers/admin/services_controller.rb

INSERT INTO "services" ("name", "description", "category", "price_rub", "position", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @service = Service.new(service_params)
    if @service.save

UPDATE "services" SET "updated_at" = ? WHERE "services"."id" = ?  [["updated_at", "2026-03-28 09:44:09.906903"], ["id", 9]]
---
  def update
    if @service.update(service_params)

SELECT "services".* FROM "services" WHERE "services"."id" = ?  [["id", 9]]
---
  def set_service
    @service = Service.find(params[:id])